k6-final-baseline-test.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: tests/k6/scenario-baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 1m0s (gracefulStop: 30s)

time="2025-12-07T10:57:01Z" level=info msg="🔧 Setting up user pool..." source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-12-07T10:57:17Z" level=info msg="✅ Loaded 50 male users" source=console
time="2025-12-07T10:57:17Z" level=info msg="✅ Loaded 50 female users" source=console

running (0m16.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 10 VUs  0m00.2s/1m0s

running (0m17.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m01.2s/1m0s

running (0m18.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m02.2s/1m0s

running (0m19.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m03.2s/1m0s

running (0m20.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m04.2s/1m0s

running (0m21.0s), 10/10 VUs, 1 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m05.2s/1m0s

running (0m22.0s), 10/10 VUs, 2 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m06.2s/1m0s

running (0m23.0s), 10/10 VUs, 4 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m07.2s/1m0s

running (0m24.0s), 10/10 VUs, 7 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m08.2s/1m0s

running (0m25.0s), 10/10 VUs, 8 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m09.2s/1m0s

running (0m26.0s), 10/10 VUs, 9 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m10.2s/1m0s

running (0m27.0s), 10/10 VUs, 13 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m11.2s/1m0s
time="2025-12-07T10:57:29Z" level=warning msg="Request Failed" error="Post \"http://localhost:3000/api/test/spin\": request timeout"
time="2025-12-07T10:57:29Z" level=warning msg="Request Failed" error="Post \"http://localhost:3000/api/test/spin\": request timeout"

running (0m28.0s), 10/10 VUs, 18 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m12.2s/1m0s

running (0m29.0s), 10/10 VUs, 19 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m13.2s/1m0s

running (0m30.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  0m14.2s/1m0s

running (0m31.0s), 10/10 VUs, 22 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  0m15.2s/1m0s

running (0m32.0s), 10/10 VUs, 23 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m16.2s/1m0s

running (0m33.0s), 10/10 VUs, 26 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  0m17.2s/1m0s

running (0m34.0s), 10/10 VUs, 28 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  0m18.2s/1m0s

running (0m35.0s), 10/10 VUs, 32 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m19.2s/1m0s

running (0m36.0s), 10/10 VUs, 32 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  0m20.2s/1m0s

running (0m37.0s), 10/10 VUs, 33 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  0m21.2s/1m0s

running (0m38.0s), 10/10 VUs, 34 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  0m22.2s/1m0s

running (0m39.0s), 10/10 VUs, 36 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  0m23.2s/1m0s

running (0m40.0s), 10/10 VUs, 37 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  0m24.2s/1m0s

running (0m41.0s), 10/10 VUs, 37 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  0m25.2s/1m0s

running (0m42.0s), 10/10 VUs, 42 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  0m26.2s/1m0s

running (0m43.0s), 10/10 VUs, 43 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  0m27.2s/1m0s

running (0m44.0s), 10/10 VUs, 45 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  0m28.2s/1m0s

running (0m45.0s), 10/10 VUs, 47 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  0m29.2s/1m0s

running (0m46.0s), 10/10 VUs, 48 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  0m30.2s/1m0s

running (0m47.0s), 10/10 VUs, 51 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  0m31.2s/1m0s

running (0m48.0s), 10/10 VUs, 55 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  0m32.2s/1m0s

running (0m49.0s), 10/10 VUs, 57 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  0m33.2s/1m0s

running (0m50.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  0m34.2s/1m0s

running (0m51.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  0m35.2s/1m0s

running (0m52.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  0m36.2s/1m0s

running (0m53.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  0m37.2s/1m0s

running (0m54.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  0m38.2s/1m0s

running (0m55.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  0m39.2s/1m0s

running (0m56.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  0m40.2s/1m0s

running (0m57.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  0m41.2s/1m0s

running (0m58.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  0m42.2s/1m0s
time="2025-12-07T10:57:59Z" level=warning msg="Request Failed" error="Post \"http://localhost:3000/api/test/spin\": request timeout"
time="2025-12-07T10:58:00Z" level=warning msg="Request Failed" error="Post \"http://localhost:3000/api/test/spin\": request timeout"

running (0m59.0s), 10/10 VUs, 68 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  0m43.2s/1m0s

running (1m00.0s), 10/10 VUs, 68 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  0m44.2s/1m0s
time="2025-12-07T10:58:02Z" level=warning msg="Request Failed" error="Post \"http://localhost:3000/api/test/spin\": request timeout"

running (1m01.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  0m45.2s/1m0s

running (1m02.0s), 10/10 VUs, 77 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  0m46.3s/1m0s

running (1m03.0s), 10/10 VUs, 79 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  0m47.2s/1m0s

running (1m04.0s), 10/10 VUs, 83 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  0m48.2s/1m0s

running (1m05.0s), 10/10 VUs, 84 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  0m49.3s/1m0s

running (1m06.0s), 10/10 VUs, 88 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  0m50.2s/1m0s

running (1m07.0s), 10/10 VUs, 91 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  0m51.2s/1m0s

running (1m08.0s), 10/10 VUs, 91 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  0m52.2s/1m0s

running (1m09.0s), 10/10 VUs, 95 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  0m53.2s/1m0s

running (1m10.0s), 10/10 VUs, 98 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  0m54.2s/1m0s

running (1m11.0s), 10/10 VUs, 99 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  0m55.2s/1m0s

running (1m12.0s), 10/10 VUs, 99 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  0m56.2s/1m0s

running (1m13.0s), 10/10 VUs, 105 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  0m57.2s/1m0s

running (1m14.0s), 10/10 VUs, 109 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  0m58.2s/1m0s

running (1m15.0s), 10/10 VUs, 115 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  0m59.2s/1m0s

running (1m16.0s), 09/10 VUs, 117 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m17.0s), 06/10 VUs, 120 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m18.0s), 03/10 VUs, 123 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<2000' p(95)=9.82s

    http_req_failed
    ✓ 'rate<0.05' rate=3.62%

    match_found
    ✓ 'rate>0.3' rate=100.00%

    spin_success
    ✗ 'rate>0.95' rate=3.96%


  █ TOTAL RESULTS 

    checks_total.......: 257    3.285782/s
    checks_succeeded...: 50.97% 131 out of 257
    checks_failed......: 49.02% 126 out of 257

    ✗ spin status is 200
      ↳  96% — ✓ 121 / ✗ 5
    ✗ spin response time < 1s
      ↳  3% — ✓ 5 / ✗ 121
    ✓ vote status is 200

    CUSTOM
    match_found....................: 100.00% 5 out of 5
    match_time_ms..................: avg=4061.2 min=3362     med=3810  max=5037   p(90)=4858.2 p(95)=4947.6
    matches_created................: 5       0.063926/s
    spin_success...................: 3.96%   5 out of 126
    spins_initiated................: 5       0.063926/s
    vote_success...................: 100.00% 5 out of 5

    HTTP
    http_req_duration..............: avg=3.54s  min=288.03ms med=2.81s max=15.45s p(90)=7.37s  p(95)=9.82s 
      { expected_response:true }...: avg=3.3s   min=288.03ms med=2.74s max=15.45s p(90)=7s     p(95)=8.3s  
    http_req_failed................: 3.62%   5 out of 138
    http_reqs......................: 138     1.76435/s

    EXECUTION
    iteration_duration.............: avg=4.87s  min=1.16s    med=4.21s max=11.66s p(90)=9.29s  p(95)=10.59s
    iterations.....................: 126     1.610928/s
    vus............................: 3       min=0        max=10
    vus_max........................: 10      min=10       max=10

    NETWORK
    data_received..................: 62 kB   787 B/s
    data_sent......................: 28 kB   354 B/s



running (1m18.2s), 00/10 VUs, 126 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  1m0s
time="2025-12-07T10:58:20Z" level=error msg="thresholds on metrics 'http_req_duration, spin_success' have been crossed"